tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'd12frosted/emacs-plus'

# Core Homebrew
brew 'asciidoctor'
brew 'aspell'
brew 'bash-completion'
brew 'bat'
brew 'cheat'
brew 'chruby'
brew 'chruby-fish'
brew 'cmake'
brew 'coreutils'
brew 'direnv'
brew 'emacs-plus@28', args: ['with-native-comp']
brew 'fd'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'graphviz'
brew 'htop'
brew 'hub'
brew 'ispell'
brew 'jansson'
brew 'jasper'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'libvterm'
brew 'mermaid-cli'
brew 'nvm'
brew 'neovim'
brew 'pandoc'
brew 'plantuml'
brew 'python@3.9'
brew 'rails-completion'
brew 'rake-completion'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rtmpdump'
brew 'ruby-completion'
brew 'ruby-install'
brew 'stow'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask 'iterm2'
cask 'kitty'
cask 'alfred'
cask 'visual-studio-code'
cask 'cron'        # Calendar
cask 'mimestream'  # Email
cask 'spotify'
cask 'docker'
cask 'font-jetbrains-mono'
cask 'raycast'
