
tap 'homebrew/cask'
tap 'd12frosted/emacs-plus'

# Core Homebrew
brew 'asciidoctor'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'bdw-gc'
brew 'bison'
brew 'cheat'
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'docker-completion'
brew 'emacs-plus'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geckodriver'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'graphviz'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'isl'
brew 'ispell'
brew 'jansson'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'lame'
brew 'leptonica'
brew 'libvterm'
brew 'lzo'
brew 'mad'
brew 'memcached'
brew 'mp3blaster'
brew 'mp4v2'
brew 'mpfr'
brew 'msgpack'
brew 'mtr'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'newsboat'
brew 'nghttp2'
brew 'nload'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'opus'
brew 'opusfile'
brew 'p11-kit'
brew 'pandoc'
brew 'pango'
brew 'patchutils'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'plantuml'
brew 'postgresql@9.6'
brew 'python'
brew 'rabbitmq'
brew 'rails-completion'
brew 'rake-completion'
brew 'ranger'
brew 'rav1e'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-completion'
brew 'ruby-install'
brew 'shellcheck'
brew 'sqlite'
brew 'srt'
brew 'stow'
brew 'tesseract'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'theora'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'v8'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wxmac'
brew 'xz'
brew 'yarn'
brew 'zeromq'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'

# Cask Apps
cask 'chromedriver'
cask 'background-music'
